app/Controllers/Accountant.php

    public function storeClaim()
    {
        helper(['url']);
        $claimsModel = model('App\\Models\\InsuranceClaimModel');

        $data = [
            'claim_no' => $this->request->getPost('claim_no'),
            'invoice_no' => $this->request->getPost('invoice_no'),
            'patient_name' => $this->request->getPost('patient_name'),
            'provider' => $this->request->getPost('provider'),
            'policy_no' => $this->request->getPost('policy_no'),
            'amount_claimed' => (float)$this->request->getPost('amount_claimed'),
            'amount_approved' => (float)($this->request->getPost('amount_approved') ?: 0),
            'status' => $this->request->getPost('status') ?: 'submitted',
            'submitted_at' => $this->request->getPost('submitted_at') ?: date('Y-m-d H:i:s'),
        ];

        $claimsModel->insert($data);
---
INSERT INTO `insurance_claims` (`claim_no`, `invoice_no`, `patient_name`, `provider`, `policy_no`, `amount_claimed`, `amount_approved`, `status`, `submitted_at`, `created_at`, `updated_at`) VALUES ('11222', '2000', 'ain reach nabale', 'jose', '1001', 1000, 700, 'approved', '2025-08-31T17:31', '2025-09-01 00:31:08', '2025-09-01 00:31:08')

    public function storePayment()
    {
        helper(['url', 'form']);

        $patient = trim((string) $this->request->getPost('patient_name'));
        $invoice = trim((string) $this->request->getPost('invoice_no'));
        $amount  = (float) $this->request->getPost('amount');
        $paidAt  = (string) $this->request->getPost('paid_at');

        if ($patient === '' || $amount <= 0) {
            return redirect()->back()->with('error', 'Patient and valid amount are required.')->withInput();
        }

        $model = new \App\Models\PaymentModel();
        $model->insert([
            'patient_name' => $patient,
            'invoice_no'   => $invoice !== '' ? $invoice : null,
            'amount'       => $amount,
            'paid_at'      => $paidAt !== '' ? $paidAt : date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `payments` (`patient_name`, `invoice_no`, `amount`, `paid_at`, `created_at`, `updated_at`) VALUES ('ain reach nabale', NULL, 10000, '2025-08-31T17:31', '2025-09-01 00:31:41', '2025-09-01 00:31:41')