app/Controllers/Admin.php

    public function dashboard()
    {
        helper(['url', 'date']);
        $userModel = model('App\\Models\\UserModel');

        // KPIs (avoid non-existent columns like 'status')
        $totalUsers = $userModel->countAllResults();
        $newUsersThisMonth = $userModel->where('created_at >=', date('Y-m-01'))->countAllResults();
        $recentUsers = $userModel->select('id, employee_id, username, role, created_at')
                                 ->orderBy('created_at', 'DESC')
                                 ->findAll(5);
---
SELECT `id`, `employee_id`, `username`, `role`, `created_at`
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5

    public function usersList()
    {
        helper(['url']);
        $page = max(1, (int) ($this->request->getGet('page') ?? 1));
        $perPage = 20;
        $offset = ($page - 1) * $perPage;
        $userModel = model('App\\Models\\UserModel');
        $total = $userModel->countAllResults();
        $users = $userModel
                    ->select('id,employee_id,username,role,created_at')
                    ->orderBy('created_at','DESC')
                    ->findAll($perPage, $offset);
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'it_staff'
SELECT `id`, `employee_id`, `username`, `role`, `created_at`
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 20