app/Controllers/Admin.php

    public function dashboard()
    {
        helper(['url', 'date']);

        // Load all models
        $userModel = model('App\\Models\\UserModel');
        $patientModel = model('App\\Models\\PatientModel');
        $appointmentModel = model('App\\Models\\AppointmentModel');
        $medicalRecordModel = model('App\\Models\\MedicalRecordModel');
        $invoiceModel = model('App\\Models\\InvoiceModel');
        $paymentModel = model('App\\Models\\PaymentModel');
        $labTestModel = model('App\\Models\\LabTestModel');
        $medicineModel = model('App\\Models\\MedicineModel');
        $inventoryModel = model('App\\Models\\InventoryModel');
        $insuranceClaimModel = model('App\\Models\\InsuranceClaimModel');

        // User Statistics
        $totalUsers = $userModel->countAllResults();
        $newUsersThisMonth = $userModel->where('created_at >=', date('Y-m-01'))->countAllResults();
        $recentUsers = $userModel->select('id, username, role, created_at')
                                 ->orderBy('created_at', 'DESC')
                                 ->findAll(5);

        // Patient Statistics
        $totalPatients = $patientModel->countAllResults();
        $newPatientsThisMonth = $patientModel->where('created_at >=', date('Y-m-01'))->countAllResults();
        $recentPatients = $patientModel->select('id, patient_id, first_name, last_name, created_at')
                                      ->orderBy('created_at', 'DESC')
                                      ->findAll(5);

        // Appointment Statistics
        $totalAppointments = $appointmentModel->countAllResults();
        $today = date('Y-m-d');

        // Try multiple approaches to get today's appointments
        $todayAppointments = $appointmentModel->where('appointment_date', $today)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `created_at` >= '2025-09-01'
SELECT `id`, `employee_id`, `username`, `role`, `created_at`
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `patients`
SELECT COUNT(*) AS `numrows`
FROM `patients`
WHERE `created_at` >= '2025-09-01'
SELECT `id`, `patient_id`, `first_name`, `last_name`, `created_at`
FROM `patients`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `appointments`
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `appointment_date` = '2025-09-21'

            $todayAppointments = $appointmentModel->where("DATE(appointment_date)", $today)->countAllResults();
        }

        $upcomingAppointments = $appointmentModel->where('appointment_date >=', date('Y-m-d'))
                                                ->where('status', 'scheduled')
                                                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `appointment_date` >= '2025-09-21'
AND `status` = 'scheduled'