app/Controllers/Auth.php

    public function doLoginSingle(): RedirectResponse
    {
        $request = $this->request;
        $username = trim((string) $request->getPost('username'));
        $password = (string) $request->getPost('password');

        if ($username === '' || $password === '') {
            return redirect()->to('/login')->with('error', 'Please enter username and password.');
        }

        $users = new UserModel();
        $user = $users->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'doc_sara'
 LIMIT 1