app/Controllers/Doctor.php

    public function dashboard()
    {
        $patientModel = new \App\Models\PatientModel();
        $appointmentModel = new \App\Models\AppointmentModel();
        $prescriptionModel = new \App\Models\PrescriptionModel();

        $patients = $patientModel->findAll();
        $appointments = $appointmentModel->where('doctor_id', session('user_id'))->findAll();
        $prescriptions = $prescriptionModel->where('doctor_id', session('user_id'))->findAll();
---
SELECT *
FROM `patients`
SELECT *
FROM `appointments`
WHERE `doctor_id` = 3
SELECT *
FROM `prescriptions`
WHERE `doctor_id` = 3