app/Controllers/Pharmacy.php

    public function dashboard()
    {
        helper('url');
        $inventory = model('App\\Models\\InventoryModel');
        $meds      = model('App\\Models\\MedicineModel');

        // Aggregate inventory per medicine (on hand stock)
        $db = \Config\Database::connect();
        $builder = $db->table('inventory i')
            ->select('i.medicine_id, SUM(i.quantity_in_stock) AS on_hand, MIN(i.reorder_level) AS reorder_level')
            ->groupBy('i.medicine_id');
        $rows = $builder->get()->getResultArray();
---
SELECT `i`.`medicine_id`, SUM(i.quantity_in_stock) AS on_hand, MIN(i.reorder_level) AS reorder_level
FROM `inventory` `i`
GROUP BY `i`.`medicine_id`

    public function inventory()
    {
        helper('url');
        $db = \Config\Database::connect();
        // Aggregate per medicine
        $summary = $db->table('inventory i')
            ->select('i.medicine_id, SUM(i.quantity_in_stock) AS on_hand, MIN(i.reorder_level) AS reorder_level')
            ->groupBy('i.medicine_id')
            ->get()->getResultArray();
---
SELECT `i`.`medicine_id`, SUM(i.quantity_in_stock) AS on_hand, MIN(i.reorder_level) AS reorder_level
FROM `inventory` `i`
GROUP BY `i`.`medicine_id`

    public function prescriptions()
    {
        helper('url');
        $medicalRecordModel = model('App\\Models\\MedicalRecordModel');

        $prescriptions = $medicalRecordModel
            ->select('medical_records.*, patients.first_name, patients.last_name, patients.patient_id as patient_code, users.first_name as doctor_first, users.last_name as doctor_last')
            ->join('patients', 'patients.id = medical_records.patient_id')
            ->join('users', 'users.id = medical_records.doctor_id')
            ->where('medical_records.medications_prescribed IS NOT NULL')
            ->where('medical_records.medications_prescribed !=', '')
            ->orderBy('medical_records.visit_date', 'DESC')
            ->findAll(50);
---
SELECT `medical_records`.*, `patients`.`first_name`, `patients`.`last_name`, `patients`.`patient_id` as `patient_code`, `users`.`first_name` as `doctor_first`, `users`.`last_name` as `doctor_last`
FROM `medical_records`
JOIN `patients` ON `patients`.`id` = `medical_records`.`patient_id`
JOIN `users` ON `users`.`id` = `medical_records`.`doctor_id`
WHERE `medical_records`.`medications_prescribed` IS NOT NULL
AND `medical_records`.`medications_prescribed` != ''
ORDER BY `medical_records`.`visit_date` DESC
 LIMIT 50

    public function lowStockAlerts()
    {
        helper('url');
        $inventoryModel = model('App\\Models\\InventoryModel');
        $medicineModel = model('App\\Models\\MedicineModel');

        $db = \Config\Database::connect();
        $builder = $db->table('inventory i')
            ->select('i.medicine_id, SUM(i.quantity_in_stock) AS on_hand, MIN(i.reorder_level) AS reorder_level')
            ->groupBy('i.medicine_id')
            ->having('on_hand <= reorder_level')
            ->having('reorder_level >', 0);
        $rows = $builder->get()->getResultArray();
---
SELECT `i`.`medicine_id`, SUM(i.quantity_in_stock) AS on_hand, MIN(i.reorder_level) AS reorder_level
FROM `inventory` `i`
GROUP BY `i`.`medicine_id`
HAVING `on_hand` <= reorder_level
AND `reorder_level` > 0